db.Договоры.aggregate([ 
{$match:{$expr:{ $gt: [{$month:"$Дата"}, 5]}}},
{$match:{$expr:{ $lt: [{$month:"$Дата"}, 9]}}},
{$match:{$expr:{ $eq: [{$year:"$Дата"}, 1997]}}},{$unwind: "$Продажи"}, 

{$lookup: {
         from: "Товары",
         localField: "Продажи.Код товара",
         foreignField: "Код товара",
         as: "Товар"
  }},

{$group:
{_id: { Товар: "$Товар.Товар", Месяц: {$month: "$Дата"}, Год: {$year: "$Дата"}}, 

СредняяЦена: {$avg: "$Продажи.Цена"},
КоличествоЕдиниц: {$sum: "$Продажи.Количество"}, 
СуммарныйВесПродаж: {$sum: { $multiply: ["$Продажи.Количество", "$Продажи.Вес"]}}, 
СуммарнаяСтоимость: { $sum: { $multiply: ["$Продажи.Количество", "$Продажи.Цена"]}}, 
КоличествоДоговоров: {$sum: 1}}}, 

{$match:{"СуммарнаяСтоимость": {"$gt": 20000}}},

{ $sort: {КоличествоДоговоров:-1} }
])
